myapp/app/Controllers/HomeController.php

    public function index()
    {
		$data['records']  =  db('home')->get()->getResult();
		$data['services'] =  db('service')->get()->getResult();
		$data['abouts']   =  db('about')->get()->getResult();
        $data['contacts']   =  db('contact')->get()->getResult();
---
SELECT *
FROM `home`
SELECT *
FROM `service`
SELECT *
FROM `about`
SELECT *
FROM `contact`